app/Controllers/Products/Products.php

    public function deleteFromCart($id)
    {
        $deleteProduct=new Cart();
        $deleteProduct->delete($id);
---
DELETE FROM `cart`
WHERE `id` IN ('18')